; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/blocksworld/domain.pddl
;;
(define (domain blocksworld)

(:requirements :strips)

(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=24, out_folder=training/easy, instance_id=81, seed=108

(define (problem blocksworld-81)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b20)
    (on b20 b14)
    (on b14 b18)
    (on-table b18)
    (clear b8)
    (on b8 b24)
    (on b24 b1)
    (on-table b1)
    (clear b16)
    (on b16 b2)
    (on b2 b19)
    (on b19 b6)
    (on b6 b12)
    (on b12 b15)
    (on b15 b17)
    (on b17 b4)
    (on-table b4)
    (clear b10)
    (on b10 b22)
    (on b22 b7)
    (on b7 b21)
    (on b21 b9)
    (on b9 b13)
    (on b13 b3)
    (on b3 b23)
    (on b23 b5)
    (on-table b5))
 (:goal  (and 
    (clear b7)
    (on b7 b9)
    (on b9 b3)
    (on b3 b24)
    (on b24 b17)
    (on-table b17)
    (clear b16)
    (on b16 b5)
    (on b5 b2)
    (on b2 b14)
    (on b14 b11)
    (on-table b11)
    (clear b18)
    (on b18 b10)
    (on b10 b13)
    (on b13 b4)
    (on b4 b22)
    (on b22 b19)
    (on b19 b20)
    (on b20 b8)
    (on b8 b6)
    (on b6 b12)
    (on b12 b1)
    (on-table b1)
    (clear b21)
    (on b21 b15)
    (on b15 b23)
    (on-table b23))))

; plan
1. (unstack b8 b24)
   deleted: (on b8 b24) (clear b8) (arm-empty)
   added: (holding b8) (clear b24)
   goals met: 3 of 28
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 28
3. (unstack b10 b22)
   deleted: (on b10 b22) (clear b10) (arm-empty)
   added: (holding b10) (clear b22)
   goals met: 3 of 28
4. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 28
5. (unstack b11 b20)
   deleted: (on b11 b20) (clear b11) (arm-empty)
   added: (holding b11) (clear b20)
   goals met: 3 of 28
6. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 4 of 28
7. (unstack b16 b2)
   deleted: (on b16 b2) (clear b16) (arm-empty)
   added: (holding b16) (clear b2)
   goals met: 3 of 28
8. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 4 of 28
9. (unstack b20 b14)
   deleted: (on b20 b14) (clear b20) (arm-empty)
   added: (holding b20) (clear b14)
   goals met: 4 of 28
10. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 4 of 28
11. (unstack b22 b7)
   deleted: (on b22 b7) (clear b22) (arm-empty)
   added: (holding b22) (clear b7)
   goals met: 5 of 28
12. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 5 of 28
13. (unstack b24 b1)
   deleted: (on b24 b1) (clear b24) (arm-empty)
   added: (holding b24) (clear b1)
   goals met: 5 of 28
14. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 5 of 28
15. (unstack b2 b19)
   deleted: (on b2 b19) (clear b2) (arm-empty)
   added: (holding b2) (clear b19)
   goals met: 5 of 28
16. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 28
17. (unstack b7 b21)
   deleted: (on b7 b21) (clear b7) (arm-empty)
   added: (holding b7) (clear b21)
   goals met: 5 of 28
18. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 6 of 28
19. (unstack b14 b18)
   deleted: (on b14 b18) (clear b14) (arm-empty)
   added: (holding b14) (clear b18)
   goals met: 7 of 28
20. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 7 of 28
21. (unstack b19 b6)
   deleted: (on b19 b6) (clear b19) (arm-empty)
   added: (holding b19) (clear b6)
   goals met: 7 of 28
22. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 7 of 28
23. (unstack b21 b9)
   deleted: (on b21 b9) (clear b21) (arm-empty)
   added: (holding b21) (clear b9)
   goals met: 6 of 28
24. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 7 of 28
25. (unstack b6 b12)
   deleted: (on b6 b12) (clear b6) (arm-empty)
   added: (holding b6) (clear b12)
   goals met: 6 of 28
26. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 6 of 28
27. (unstack b9 b13)
   deleted: (on b9 b13) (clear b9) (arm-empty)
   added: (holding b9) (clear b13)
   goals met: 6 of 28
28. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 6 of 28
29. (unstack b12 b15)
   deleted: (on b12 b15) (clear b12) (arm-empty)
   added: (holding b12) (clear b15)
   goals met: 6 of 28
30. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 6 of 28
31. (unstack b13 b3)
   deleted: (on b13 b3) (clear b13) (arm-empty)
   added: (holding b13) (clear b3)
   goals met: 6 of 28
32. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 6 of 28
33. (unstack b15 b17)
   deleted: (on b15 b17) (clear b15) (arm-empty)
   added: (holding b15) (clear b17)
   goals met: 6 of 28
34. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 6 of 28
35. (unstack b17 b4)
   deleted: (on b17 b4) (clear b17) (arm-empty)
   added: (holding b17) (clear b4)
   goals met: 6 of 28
36. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 7 of 28
37. (unstack b3 b23)
   deleted: (on b3 b23) (clear b3) (arm-empty)
   added: (holding b3) (clear b23)
   goals met: 7 of 28
38. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 28
39. (unstack b23 b5)
   deleted: (on b23 b5) (clear b23) (arm-empty)
   added: (holding b23) (clear b5)
   goals met: 7 of 28
40. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 8 of 28
41. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 8 of 28
42. (stack b12 b1)
   deleted: (clear b1) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b1)
   goals met: 9 of 28
43. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 9 of 28
44. (stack b14 b11)
   deleted: (clear b11) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b11)
   goals met: 10 of 28
45. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 10 of 28
46. (stack b15 b23)
   deleted: (clear b23) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b23)
   goals met: 11 of 28
47. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 10 of 28
48. (stack b21 b15)
   deleted: (clear b15) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b15)
   goals met: 12 of 28
49. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 12 of 28
50. (stack b24 b17)
   deleted: (clear b17) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b17)
   goals met: 13 of 28
51. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 13 of 28
52. (stack b2 b14)
   deleted: (clear b14) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b14)
   goals met: 14 of 28
53. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 14 of 28
54. (stack b3 b24)
   deleted: (clear b24) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b24)
   goals met: 15 of 28
55. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 15 of 28
56. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 16 of 28
57. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 16 of 28
58. (stack b6 b12)
   deleted: (clear b12) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b12)
   goals met: 17 of 28
59. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 17 of 28
60. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 18 of 28
61. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 18 of 28
62. (stack b9 b3)
   deleted: (clear b3) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b3)
   goals met: 19 of 28
63. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 18 of 28
64. (stack b16 b5)
   deleted: (clear b5) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b5)
   goals met: 20 of 28
65. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 20 of 28
66. (stack b20 b8)
   deleted: (clear b8) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b8)
   goals met: 21 of 28
67. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 20 of 28
68. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 22 of 28
69. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 22 of 28
70. (stack b19 b20)
   deleted: (clear b20) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b20)
   goals met: 23 of 28
71. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 23 of 28
72. (stack b22 b19)
   deleted: (clear b19) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b19)
   goals met: 24 of 28
73. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 24 of 28
74. (stack b4 b22)
   deleted: (clear b22) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b22)
   goals met: 25 of 28
75. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 25 of 28
76. (stack b13 b4)
   deleted: (clear b4) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b4)
   goals met: 26 of 28
77. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 26 of 28
78. (stack b10 b13)
   deleted: (clear b13) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b13)
   goals met: 27 of 28
79. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 26 of 28
80. (stack b18 b10)
   deleted: (clear b10) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b10)
   goals met: 28 of 28
